layer {
  name: "input_1"
  type: "Input"
  top: "input_1"
  phase: TRAIN
  input_param {
    shape {
      dim: 1
      dim: 1
      dim: 118
      dim: 80
    }
  }
}
layer {
  name: "conv2d_1"
  type: "Convolution"
  bottom: "input_1"
  top: "conv2d_1"
  phase: TRAIN
  convolution_param {
    num_output: 20
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "conv2d_1_activation"
  type: "ReLU"
  bottom: "conv2d_1"
  top: "conv2d_1"
  phase: TRAIN
}
layer {
  name: "batch_normalization_1"
  type: "Scale"
  bottom: "conv2d_1"
  top: "batch_normalization_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  scale_param {
    bias_term: true
  }
}
layer {
  name: "max_pooling2d_1"
  type: "Pooling"
  bottom: "batch_normalization_1"
  top: "max_pooling2d_1"
  phase: TRAIN
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
    pad_h: 0
    pad_w: 0
  }
}
layer {
  name: "conv2d_2"
  type: "Convolution"
  bottom: "max_pooling2d_1"
  top: "conv2d_2"
  phase: TRAIN
  convolution_param {
    num_output: 40
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "conv2d_2_activation"
  type: "ReLU"
  bottom: "conv2d_2"
  top: "conv2d_2"
  phase: TRAIN
}
layer {
  name: "batch_normalization_2"
  type: "Scale"
  bottom: "conv2d_2"
  top: "batch_normalization_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  scale_param {
    bias_term: true
  }
}
layer {
  name: "max_pooling2d_2"
  type: "Pooling"
  bottom: "batch_normalization_2"
  top: "max_pooling2d_2"
  phase: TRAIN
  pooling_param {
    pool: MAX
    stride: 1
    kernel_h: 1
    kernel_w: 2
    pad_h: 0
    pad_w: 0
  }
}
layer {
  name: "conv2d_3"
  type: "Convolution"
  bottom: "max_pooling2d_2"
  top: "conv2d_3"
  phase: TRAIN
  convolution_param {
    num_output: 40
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "conv2d_3_activation"
  type: "ReLU"
  bottom: "conv2d_3"
  top: "conv2d_3"
  phase: TRAIN
}
layer {
  name: "batch_normalization_3"
  type: "Scale"
  bottom: "conv2d_3"
  top: "batch_normalization_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  scale_param {
    bias_term: true
  }
}
layer {
  name: "max_pooling2d_3"
  type: "Pooling"
  bottom: "batch_normalization_3"
  top: "max_pooling2d_3"
  phase: TRAIN
  pooling_param {
    pool: MAX
    stride: 1
    kernel_h: 1
    kernel_w: 2
    pad_h: 0
    pad_w: 0
  }
}
layer {
  name: "flatten_1"
  type: "Flatten"
  bottom: "max_pooling2d_3"
  top: "flatten_1"
  phase: TRAIN
}
layer {
  name: "dense_1"
  type: "InnerProduct"
  bottom: "flatten_1"
  top: "dense_1"
  phase: TRAIN
  inner_product_param {
    num_output: 64
    bias_term: true
  }
}
layer {
  name: "dense_1_activation"
  type: "ReLU"
  bottom: "dense_1"
  top: "dense_1"
  phase: TRAIN
}
layer {
  name: "dense_2"
  type: "InnerProduct"
  bottom: "dense_1"
  top: "dense_2"
  phase: TRAIN
  inner_product_param {
    num_output: 32
    bias_term: true
  }
}
layer {
  name: "dense_2_activation"
  type: "ReLU"
  bottom: "dense_2"
  top: "dense_2"
  phase: TRAIN
}
layer {
  name: "dense_3"
  type: "InnerProduct"
  bottom: "dense_2"
  top: "dense_3"
  phase: TRAIN
  inner_product_param {
    num_output: 2
    bias_term: true
  }
}
layer {
  name: "dense_3_activation"
  type: "Softmax"
  bottom: "dense_3"
  top: "dense_3_activation"
  phase: TRAIN
}
